huybk213/nrf52-sdk5-privacy-address-with-whitelist/ble_app_uart_scan/main.c
static uint16_t m_conn_handle          = BLE_CONN_HANDLE_INVALID;                   /**< Handle of the current connection. */
static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;              /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
        {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

#define DM_PUBLIC_ADDR                      ((ble_gap_addr_t) {0,BLE_GAP_ADDR_TYPE_PUBLIC,{0xAB,0x02,0x03,0x04,0x05,0x06}})
#define DM_PUBLIC_IRK                       ((ble_gap_irk_t) {{0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F, 0x10}})

static ble_gap_irk_t m_irk;                                                 /**< IRK to signal DM support. */
static ble_gap_addr_t m_id_addr;                                            /**< internal address to signal DM support. */
static ble_gap_id_key_t* m_key_ptrs[BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT];   /**< IRK store */

typedef ble_gap_addr_t dm_addr_t;

typedef struct
{
        dm_addr_t peer_addr;            /**< 32-bit address */
        uint8_t sync_freq_chan;         /**< DM synchronization frequency */
} dm_event_data_t;

/* The advertising payload data will come compact */
#pragma pack(push, 1)
typedef struct
{
        uint16_t company_identifier;                    /**< Company Identifier Code. */
        dm_event_data_t dm_event_data;                  /**< Additional distance measurement specific data. */
} dm_adv_data_manuf_data_t;
#pragma pack(pop)


/**@brief Scan data structure.
 */
typedef struct
{
        bool initialized;
        ble_gap_scan_params_t scan_params;          /**< GAP scanning parameters. */
        uint8_t scan_buffer_data[NRF_BLE_SCAN_BUFFER]; /**< Buffer where advertising reports will be stored by the SoftDevice. */
        ble_data_t scan_buffer;                     /**< Structure-stored pointer to the buffer where advertising reports will be stored by the SoftDevice. */
} dm_ble_scan_t;


static dm_ble_scan_t m_scann_ctx;                                           /**< Scanning context data. */

#define APP_SCAN_SCAN_INTERVAL      0x10                            /**< Scanning interval. Determines the scan interval in units of 0.625 millisecond. */
#define APP_SCAN_SCAN_WINDOW        0x10                            /**< Scanning window. Determines the scanning window in units of 0.625 millisecond. */
#define APP_SCAN_ACTIVE_DISABLED    0                               /**< Only passive scanning will be processed, no scan request send. */
#define APP_SCAN_ACTIVE_ENABLED     1

#define APP_SCAN_DURATION           BLE_GAP_SCAN_TIMEOUT_UNLIMITED  /**< Duration of the scanning in units of 10 milliseconds. */
#define SCAN_DURATION_WHITELIST      3000                           /**< Duration of the scanning in units of 10 milliseconds. */


static ret_code_t scan_start(dm_ble_scan_t const * const p_scan_ctx);
static void scan_stop(void);


static bool m_whitelist_is_running = false;

static ble_gap_addr_t const * m_whitelist_addr_ptrs[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
static ble_gap_addr_t m_whitelist_addrs[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];

static ble_gap_id_key_t const * m_id_key_ptrs[BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT];
static ble_gap_id_key_t m_id_keys[BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT];

static uint8_t m_addr_cnt = 0;
static uint8_t m_irk_cnt = 0;
static bool m_whitelist_disabled = false;

static bool m_ble_is_scanning = false;

static uint8_t nrf_ble_whitelist_cnt(void)
{
        return m_addr_cnt;
}

ret_code_t nrf_ble_whitelist_add(ble_gap_addr_t *addr, uint8_t * whitelist_count)
{
        if (m_addr_cnt >= BLE_GAP_WHITELIST_ADDR_MAX_COUNT)
                return NRF_ERROR_DATA_SIZE;

        for (uint32_t i = 0; i < BLE_GAP_WHITELIST_ADDR_MAX_COUNT; i++)
        {
                if (memcmp(&m_whitelist_addrs[i], addr, sizeof(ble_gap_addr_t))==0)
                {
                        //NRF_LOG_INFO("[Whitelist]: Duplicate Whitelist add!");
                        return NRF_ERROR_INVALID_PARAM;
                }
        }

        memcpy(&m_whitelist_addrs[m_addr_cnt], addr, sizeof(ble_gap_addr_t));

        m_addr_cnt++;

        //return the number of whitelist store
        *whitelist_count = m_addr_cnt;

        return NRF_SUCCESS;
}

ret_code_t nrf_ble_whitelist_enable(void)
{
        ret_code_t ret;

        if (m_addr_cnt == 0)
        {
                return NRF_ERROR_DATA_SIZE;
        }

        for (uint32_t i = 0; i < BLE_GAP_WHITELIST_ADDR_MAX_COUNT; i++)
        {
                m_whitelist_addr_ptrs[i] = &m_whitelist_addrs[i];
        }

        ret = sd_ble_gap_whitelist_set(m_whitelist_addr_ptrs, m_addr_cnt);
        APP_ERROR_CHECK(ret);

        return NRF_SUCCESS;
}

static void on_whitelist_req(void)
{
        ret_code_t ret;
        if ((nrf_ble_whitelist_cnt() == 0) ||
            (m_whitelist_disabled))
        {
                //m_scann_ctx.scan_params.filter_policy  = BLE_GAP_SCAN_FP_ACCEPT_ALL;
                m_scann_ctx.scan_params.active        = APP_SCAN_ACTIVE_ENABLED;
                m_scann_ctx.scan_params.interval      = APP_SCAN_SCAN_INTERVAL;
                m_scann_ctx.scan_params.window        = APP_SCAN_SCAN_WINDOW;
                m_scann_ctx.scan_params.filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL;
                m_scann_ctx.scan_params.timeout       = APP_SCAN_DURATION;
                m_scann_ctx.scan_params.scan_phys     = BLE_GAP_PHY_1MBPS;

                //m_scan_param.filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL;
                //ret = nrf_ble_scan_params_set(&m_scan, &m_scan_param);
                //APP_ERROR_CHECK(ret);
                NRF_LOG_INFO("on_whitelist_req BLE_GAP_SCAN_FP_ACCEPT_ALL");
        }
        else
        {
                ret = nrf_ble_whitelist_enable();
                APP_ERROR_CHECK(ret);

                m_scann_ctx.scan_params.active        = APP_SCAN_ACTIVE_ENABLED;
                m_scann_ctx.scan_params.interval      = APP_SCAN_SCAN_INTERVAL;
                m_scann_ctx.scan_params.window        = APP_SCAN_SCAN_WINDOW;
                m_scann_ctx.scan_params.filter_policy = BLE_GAP_SCAN_FP_WHITELIST;
                m_scann_ctx.scan_params.timeout       = SCAN_DURATION_WHITELIST;
                m_scann_ctx.scan_params.scan_phys     = BLE_GAP_PHY_1MBPS;

                ble_gap_id_key_t id_irk = {
                        .id_info = m_irk,
                        .id_addr_info = m_id_addr
                };
                m_key_ptrs[0] = &id_irk;

                if(NRF_SUCCESS != sd_ble_gap_device_identities_set((const ble_gap_id_key_t**) &m_key_ptrs[0], NULL, 1))
                {
                        APP_ERROR_CHECK(false);
                }
                NRF_LOG_INFO("on_whitelist_req IRK");
        }
}

/**@brief Function for disabling the use of the whitelist for scanning.
 */
static void whitelist_disable(void)
{
        if (!m_whitelist_disabled)
        {
                NRF_LOG_INFO("Whitelist temporarily disabled.");
                m_whitelist_disabled = true;
                scan_stop();
                scan_start(&m_scann_ctx);
        }
}

