huybk213/nrf52-sdk5-privacy-address-with-whitelist/ble_app_uart_scan/main.c
ret_code_t scan_init(dm_ble_scan_t * const p_scan_ctx)
{
        VERIFY_PARAM_NOT_NULL(p_scan_ctx);
        ret_code_t err_code;
        p_scan_ctx->scan_params.active        = APP_SCAN_ACTIVE_ENABLED;
        p_scan_ctx->scan_params.interval      = APP_SCAN_SCAN_INTERVAL;
        p_scan_ctx->scan_params.window        = APP_SCAN_SCAN_WINDOW;
        p_scan_ctx->scan_params.filter_policy = BLE_GAP_SCAN_FP_WHITELIST;//BLE_GAP_SCAN_FP_ACCEPT_ALL;
        p_scan_ctx->scan_params.timeout       = SCAN_DURATION_WHITELIST;//APP_SCAN_DURATION;
        p_scan_ctx->scan_params.scan_phys     = BLE_GAP_PHY_1MBPS;

        // Assign a buffer where the advertising reports are to be stored by the SoftDevice.
        p_scan_ctx->scan_buffer.p_data = p_scan_ctx->scan_buffer_data;
        p_scan_ctx->scan_buffer.len    = sizeof(p_scan_ctx->scan_buffer_data);

        ble_gap_addr_t whitelist_addrs;
        uint8_t whitelist_number;
        memcpy(&whitelist_addrs, &m_id_addr, sizeof(ble_gap_addr_t));
        whitelist_addrs.addr_id_peer = 0x01;

        err_code = nrf_ble_whitelist_add(&whitelist_addrs, &whitelist_number);
        APP_ERROR_CHECK(err_code);

        return NRF_SUCCESS;
}


ret_code_t scan_start(dm_ble_scan_t const * const p_scan_ctx)
{
        VERIFY_PARAM_NOT_NULL(p_scan_ctx);

        ret_code_t err_code;

        if (m_ble_is_scanning)
        {
                scan_stop();
        }

        on_whitelist_req();

        // Start the scanning.
        err_code = sd_ble_gap_scan_start(&p_scan_ctx->scan_params, &p_scan_ctx->scan_buffer);

        // It is okay to ignore this error, because the scan stopped earlier.
        if ((err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_SUCCESS))
        {
                NRF_LOG_ERROR("sd_ble_gap_scan_start returned 0x%x", err_code);
                return (err_code);
        }
        NRF_LOG_INFO("Starting scan.");

        m_ble_is_scanning = true;

        return NRF_SUCCESS;
}

/**@brief Function for stopping the scanning.
 */
static void scan_stop(void)
{
        // It is ok to ignore the function return value here, because this function can return NRF_SUCCESS or
        // NRF_ERROR_INVALID_STATE, when app is not in the scanning state.
        UNUSED_RETURN_VALUE(sd_ble_gap_scan_stop());
}


/**@brief Function for initializing privacy.
 *
 * @note Privacy is used to check if the peer supports ranging.
 */
static void privacy_init(void)
{
        m_irk = DM_PUBLIC_IRK;
        m_id_addr = DM_PUBLIC_ADDR;
        ble_gap_id_key_t id_irk = {
                .id_info = m_irk,
                .id_addr_info = m_id_addr
        };
        m_key_ptrs[0] = &id_irk;

        ble_gap_privacy_params_t privacy = {
                .privacy_mode = BLE_GAP_PRIVACY_MODE_DEVICE_PRIVACY,
                .private_addr_type = BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE,
                .private_addr_cycle_s = 0,
                .p_device_irk = &m_irk
        };

        APP_ERROR_CHECK(sd_ble_gap_privacy_set(&privacy));

        if(NRF_SUCCESS != sd_ble_gap_device_identities_set((const ble_gap_id_key_t**) &m_key_ptrs[0], NULL, 1))
        {
                APP_ERROR_CHECK(false);
        }

        NRF_LOG_INFO("Privacy Init Key set");
}


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
        app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
        ret_code_t err_code = app_timer_init();
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
        uint32_t err_code;
        ble_gap_conn_params_t gap_conn_params;
        ble_gap_conn_sec_mode_t sec_mode;

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

        err_code = sd_ble_gap_device_name_set(&sec_mode,
                                              (const uint8_t *) DEVICE_NAME,
                                              strlen(DEVICE_NAME));
        APP_ERROR_CHECK(err_code);

        memset(&gap_conn_params, 0, sizeof(gap_conn_params));

        gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
        gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
        gap_conn_params.slave_latency     = SLAVE_LATENCY;
        gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

        err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

        if (p_evt->type == BLE_NUS_EVT_RX_DATA)
        {
                uint32_t err_code;

                NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
                NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

                for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
                {
                        do
                        {
                                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                                {
                                        NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                                        APP_ERROR_CHECK(err_code);
                                }
                        } while (err_code == NRF_ERROR_BUSY);
                }
                if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
                {
                        while (app_uart_put('\n') == NRF_ERROR_BUSY);
                }
        }

