huybk213/nrf52-sdk5-privacy-address-with-whitelist/ble_app_uart_scan/main.c
                if (parsed_name_len != 0)
                {
                        data_offset = 0;
                        uint8_t manuf_data_len =
                                ble_advdata_search(p_ble_evt->evt.gap_evt.params.adv_report.data.p_data,
                                                   p_ble_evt->evt.gap_evt.params.adv_report.data.len,
                                                   &data_offset,
                                                   BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA);

                        if (manuf_data_len != 0)
                        {
                                dm_adv_data_manuf_data_t * manuf_advdata =
                                        (dm_adv_data_manuf_data_t *)&p_ble_evt->evt.gap_evt.params.adv_report.data.p_data[data_offset];

                                if (manuf_advdata->company_identifier == 0x0059)
                                {
                                        //NRF_LOG_INFO("Manu 0x0059");
                                        //dm_event_post(p_ble_evt, &manuf_advdata->dm_event_data);

                                }
                                if (m_whitelist_is_used)
                                {
                                      NRF_LOG_INFO("ADV report with whitelist");
                                     //   NRF_LOG_HEXDUMP_INFO(p_ble_evt->evt.gap_evt.params.adv_report.data.p_data, p_ble_evt->evt.gap_evt.params.adv_report.data.len);
                                }
                                else
                                {
                                      NRF_LOG_INFO("ADV report without whitelist");
                                }


                        }

                        // Check the manufacturer filter.
                        ////if (manufacturer_filter_enabled)
                        //{
                        //        //filter_cnt++;

                        //        NRF_LOG_HEXDUMP_INFO(p_adv_report->data.p_data, p_adv_report->data.len);
                        //        if (adv_manufacturer_specific_compare(p_adv_report, p_scan_ctx))
                        //        {
                        //                NRF_LOG_INFO("Match Manufacturer Specific Data");
                        //                //filter_match_cnt++;
                        //                // Information about the filters matched.
                        //                scan_evt.params.filter_match.filter_match.manufacturer_specific_filter_match = true;
                        //                //is_filter_matched = true;
                        //        }
                        //}
                        //NRF_LOG_INFO("BLE_GAP_EVT_ADV_REPORT");


                }
                //// Resume the scanning.
                ret_code_t err_code = sd_ble_gap_scan_start(NULL, &p_scan_ctx->scan_buffer);
                APP_ERROR_CHECK(err_code);

        }
        break;
        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
                // Pairing not supported
                err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
                // No system attributes have been stored.
                err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_GATTC_EVT_TIMEOUT:
                // Disconnect on GATT Client timeout event.
                err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_GATTS_EVT_TIMEOUT:
                // Disconnect on GATT Server timeout event.
                err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
                break;

        default:
                // No implementation needed.
                break;
        }
}

/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
        APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}


/**@brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
        ret_code_t err_code;

        err_code = nrf_sdh_enable_request();
        APP_ERROR_CHECK(err_code);

        // Configure the BLE stack using the default settings.
        // Fetch the start address of the application RAM.
        uint32_t ram_start = 0;
        err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
        APP_ERROR_CHECK(err_code);

        // Enable BLE stack.
        err_code = nrf_sdh_ble_enable(&ram_start);
        APP_ERROR_CHECK(err_code);

        err_code = sd_power_mode_set(NRF_POWER_MODE_LOWPWR);
        APP_ERROR_CHECK(err_code);

        err_code = sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
        APP_ERROR_CHECK(err_code);

        // Register a handler for BLE events.
        NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, &m_scann_ctx);
}


/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
        uint16_t data_length = 0;
        if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
        {
                m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
                NRF_LOG_INFO("Data len is set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
        }
        else if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_DATA_LENGTH_UPDATED))
        {
                data_length = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH - 4;
                NRF_LOG_INFO("gatt_event: Data len is set to 0x%X (%d)", data_length, data_length);
        }
        NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
                      p_gatt->att_mtu_desired_central,
                      p_gatt->att_mtu_desired_periph);
}


