huybk213/nrf52-sdk5-privacy-address-with-whitelist/ble_app_uart_scan/main.c
        *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
        ret_code_t err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
        ret_code_t err_code;
        err_code = nrf_pwr_mgmt_init();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{

        app_sched_execute();
        if (NRF_LOG_PROCESS() == false)
        {
                nrf_pwr_mgmt_run();
        }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
        uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
}

/**@brief Callback function that triggers GPIO pin state change on change of radio activity
 *
 * @param[in] radio_active   Flag that informs if radio was activated or deactivated
 */
void ble_on_radio_active_evt(bool radio_active)
{
        if(radio_active) {
                //dm_debug_set_pin(DM_DEBUG_PIN_6);
        } else {
                //dm_debug_clear_pin(DM_DEBUG_PIN_6);
        }
}

/**@brief Function for initialization of a callback to notify on radio activity.
 *
 * @note This function is related with debugging of radio behaviour.
 */
static void radio_notification_init(void)
{
        uint32_t err_code;

        err_code = ble_radio_notification_init(APP_IRQ_PRIORITY_LOW,
                                               NRF_RADIO_NOTIFICATION_DISTANCE_800US,
                                               ble_on_radio_active_evt);

        err_code = sd_radio_notification_cfg_set(NRF_RADIO_NOTIFICATION_TYPE_INT_ON_INACTIVE,
                                                 NRF_RADIO_NOTIFICATION_DISTANCE_800US);
        APP_ERROR_CHECK(err_code);

}

/**@brief Application main function.
 */
int main(void)
{
        bool erase_bonds;

        // Initialize.
        uart_init();
        log_init();
        timers_init();
        buttons_leds_init(&erase_bonds);
        power_management_init();

        scheduler_init();

        ble_stack_init();

        privacy_init();
        radio_notification_init();


        gap_params_init();
        gatt_init();
        services_init();
        advertising_init();
        conn_params_init();

        scan_init(&m_scann_ctx);

        // Start execution.
        NRF_LOG_INFO("UART Peripheral over RTT started.");

        advertising_start();

        scan_start(&m_scann_ctx);

        // Enter main loop.
        for (;;)
        {
                idle_state_handle();
        }
}


/**
 * @}
 */
